//===============================================================================
//
//  地形メッシュの処理(mesh_ground.cpp)
//								制作：元地弘汰
// 
//===============================================================================
#include "floor_stone.h"

#include "manager.h"
#include "game.h"


CMeshGround::CMeshGround(int nPriority) :CObjectX(nPriority), m_mode(0)
{

}

CMeshGround::~CMeshGround()
{

}

//==========================================================================================
//初期化処理
//==========================================================================================
void CMeshGround::Init()
{
	CObject::SetType(TYPE_3D_MESHOBJECT);
	CObjectX::Init();
}

//==========================================================================================
//終了処理
//==========================================================================================
void CMeshGround::Uninit()
{
	CObjectX::Uninit();
}

//==========================================================================================
//更新処理
//==========================================================================================
void CMeshGround::Update()
{
	
	CObjectX::Update();
}

//==========================================================================================
//描画処理
//==========================================================================================
void CMeshGround::Draw()
{
	LPDIRECT3DDEVICE9 pDevice = CManager::GetInstance()->GetRenderer()->GetDevice();;

	CObjectX::Draw();
}

//==========================================================================================
//生成処理
//==========================================================================================
CMeshGround* CMeshGround::Create(D3DXVECTOR3 pos)
{
	CMeshGround* enemy = new CMeshGround;
	enemy->BindModel("data\\MODEL\\Floor_box.x");
	enemy->SetModelParam(pos);
	enemy->Init();
	return enemy;
}

